app/controllers/games_controller.rb

INSERT INTO "games" ("created_at", "description", "name", "nickname", "rules", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 22 Sep 2013 19:17:04 UTC +00:00], ["description", ""], ["name", "Table Tennis"], ["nickname", "Ping Pong"], ["rules", ""], ["updated_at", Sun, 22 Sep 2013 19:17:04 UTC +00:00]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save