app/controllers/game_configurations_controller.rb

  def index
    @game_configurations = GameConfiguration.all
---
SELECT "game_configurations".* FROM "game_configurations"

  def create
    @game_configuration = GameConfiguration.new(game_configuration_params)

    respond_to do |format|
      if @game_configuration.save
---
INSERT INTO "game_configurations" ("created_at", "game_id", "metadata", "title", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_game_configuration
      @game_configuration = GameConfiguration.find(params[:id])
---
SELECT "game_configurations".* FROM "game_configurations" WHERE "game_configurations"."id" = ? LIMIT 1  [["id", "1"]]