app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("address", "created_at", "kml_url", "name", "nickname", "updated_at") VALUES (?, ?, ?, ?, ?, ?)