app/controllers/matches_controller.rb

INSERT INTO "matches" ("created_at", "final_player_id", "game_id", "is_valid", "location_id", "player_id_list", "score_list", "status_id", "turn_count", "updated_at", "zone_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @match = Match.new(match_params)

    respond_to do |format|
      if @match.save

UPDATE "matches" SET "player_id_list" = ?, "score_list" = ?, "date_started" = ?, "date_finished" = ?, "running_time" = ?, "updated_at" = ? WHERE "matches"."id" = 1
---
  def update
    respond_to do |format|
      if @match.update(match_params)

SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT 1  [["id", "create"]]
---
    def set_match
      @match = Match.find(params[:id])