app/controllers/players_controller.rb

INSERT INTO "players" ("avatar_url", "birthday", "created_at", "email", "facebook_token", "first_name", "gender", "last_name", "nickname", "password", "short_bio", "skype_name", "twitter_token", "twitter_token_secret", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save