app/controllers/turns_controller.rb

  def index
    @turns = Turn.all
---
SELECT "turns".* FROM "turns"

  def create
    @turn = Turn.new(turn_params)

    respond_to do |format|
      if @turn.save
---
INSERT INTO "turns" ("created_at", "delta", "game_id", "is_active", "match_id", "metadata", "player_id", "running_time", "score", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)